{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "anger",
    "1": "boredom",
    "2": "empty",
    "3": "enthusiasm",
    "4": "fun",
    "5": "happiness",
    "6": "hate",
    "7": "love",
    "8": "neutral",
    "9": "relief",
    "10": "sadness",
    "11": "surprise",
    "12": "worry"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "anger": 0,
    "boredom": 1,
    "empty": 2,
    "enthusiasm": 3,
    "fun": 4,
    "happiness": 5,
    "hate": 6,
    "love": 7,
    "neutral": 8,
    "relief": 9,
    "sadness": 10,
    "surprise": 11,
    "worry": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
